app/Controllers/Cliente.php

SELECT *
FROM `clientes`
 LIMIT 500, 10
SELECT COUNT(*) AS `numrows`
FROM `clientes`
---
    public function listarClientes()
    {
        $cliente = new ClienteModel();
        $listaDeClientes = $cliente->paginate(10);

INSERT INTO `clientes` (`nombres`, `apellidos`, `telefono`, `email`, `dui`) VALUES ('Rafael Javier', 'perez carrillo', '2345-7612', 'Evelin@gmail.com', '95293757-7')
---
    public function registrarCliente()
    {
        if ( $this->request->getMethod() == "post" ) {
            $cliente = new ClienteModel();
            $nombres = $this->request->getPost("nombres");
            $apellidos = $this->request->getPost("apellidos");
            $telefono = $this->request->getPost("telefono");
            $email = $this->request->getPost("email");
            $dui = $this->request->getPost("dui");
            $datosCliente = [
                "nombres" => $nombres,
                "apellidos" => $apellidos,
                "telefono" => $telefono,
                "email" => $email,
                "dui" => $dui
            ];
            if ( $cliente->insert($datosCliente) === false )

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'
---
    public function editarCliente($id)
    {
        $cliente = new ClienteModel();
        $unCliente = $cliente->find($id);